[
  {
    "name": "Aatrox (Character)",
    "url": "https://leagueoflegends.fandom.com/wiki/Aatrox",
    "infobox": {},
    "background": "As a mortal, Aatrox was born and raised in Shurima at the height of its power. He eventually became a champion of the empire, being honored for his service as a strong warrior. During this time, he had served it for all his life. He was a noble warrior and would not hesitate to fight alongside his fellow soldiers in battle.\nAatrox was one of the first to be granted the gift of Ascension in the ancient times of Shurima, a rite that was reserved for those near the end of their life. Once he was Ascended, Aatrox was granted a heightened role within the military as a member of the Ascended Host. As one of the most powerful of the Ascended, Aatrox fought and even killed Spirit Gods and other powerful beings.\nWhen Icathia rebelled against the emperor , the Ascended hero Setaka requested that Aatrox aid her in fighting them back alongside the rest of the Ascended Host. Answering the call with no hesitation, he helped drive back the Void when the Icathians tried weaponizing it, an event that deeply scarred his mind and lead to the loss of his wings.\nAfter the Shuriman Empire fell due to the sudden death of emperor Azir , the Ascended renamed themselves Sunborn and clashed with each other due to the lack of leadership and purpose. Their battle brought so much devastation that the mortals eventually began to call these Sunborn Darkin , an old Shuriman word which most closely translated to 'The Fallen.'\nDuring the war, Aatrox was an honored general who commanded several other Darkin to his side in an attempt to unify them again. It's implied that Aatrox was one of five notably powerful Darkin that fought side by side during the war and sought to bring ruin to the entire world once reunited. These Darkin include Aatrox himself, Rhaast , Varus , Naafiri and an unknown fifth Darkin.\nAatrox had a particular rivalry with Xolaani , who utilized her talents in blood magic to puppeteer the bodies of the other Darkin to her will in an attempt to end the war. Horiffied by this, Aatrox named Xolaani a coward for her methods and honed a deep, violent hatred for her.\nFearing for the fate of Runeterra, the Celestial beings of Targon intervened as the 5 Aspect of War , also known as Pantheon , rallied mortals to fight back against the Darkin while Myisha the Aspect of Twilight taught mortals how to imprison the Darkin within their own weapons. Aatrox fought against Pantheon with an army of his own, ultimately losing and becoming deceived as he became one of the first Darkin to become imprisoned. Trapped within his sword in a torturous existence, Aatrox continued to hopelessly reach out of his prison in agony.\nEventually, an unknown mortal man fled a battle and, out of desperation to defend himself, tried to wield Aatrox's sword. Using hemomancy, Aatrox quickly took over this human's body and reformed it as close to his original Ascended form as possible. Fearing that this body was too weak to withstand his Darkin essence, Aatrox looked toward a city caught in the middle of a chaotic battle and planned to slaughter as many mortals as possible and repurpose their corpses to strengthen his new form.\nAatrox possessed many men and women over the years, learning how to take over a body instantly and feast on his enemies' flesh. Aatrox travelled the world in search of a way to return to his Ascended form but realized that there was no escape from his prison and despaired. With that, Aatrox grew desperate and decided that since he cannot truly free himself from the blade, he would instead end all of existence including himself in a terrible cataclysm. Marching with a new purpose, Aatrox brought war and death wherever he went, hoping to create a battle apocalyptic enough to bring oblivion to everything.\nAt some point, Aatrox gathered and lead a massive army of raiders and lead them to the growing refugee settlement of Demacia . Attacking from the sky, Aatrox faced off against Demacia's winged protectors; the twins Kayle and Morgana . As the twins fought him in the sky, Aatrox managed to defeat them and marched alongside his army towards Demacia's gates. As a last resort, Morgana tapped into dark magics and summoned magical chains from the ground to restrain Aatrox. While restrained, Kayle fired a blast of holy flames at Aatrox, seemingly defeating him and his army.\nOn his quest to achieve oblivion and enact vengeance against the Aspects that trapped him, Aatrox travelled to Mount Targon and terrorized armies of barbarians on his way there, driving them into Targonian lands. Seeking to reach the mountain's summit, Aatrox faced off against Pantheon and confronted him in a battle in the skies. Aatrox achieved what was thought impossible and stabbed his sword through Pantheon's chest, wounding him so deeply that he carved the constellation of War out of the cosmos, essentially killing the Aspect. Only the Aspect's host Atreus remained, spitting in Aatrox's face as he sneered and left him to die to his wounds.\nEventually, a fully recovered Atreus returned and stood between Aatrox and an army of barbarians, wielding the now fallen Aspect's dulled spear and shield. Aatrox mocked Atreus for being foolish enough to face him without the powers of Pantheon and fought him, casting Atreus down to his knees. Before striking the killing blow, Atreus managed to awaken the residual celestial power within himself and reignited the powers of Pantheon, leaping into the air and severing Aatrox's sword arm and defeating him.\nAatrox eventually gained a new host and began a rampage in the northern parts of Valoran , such as the Freljord . One night, Aatrox flew across a snowstorm and appeared before Tryndamere's clan, who mistook the Darkin for their horned god the 8 Iron Boar . As some of the tribespeople began to kneel and pray, Aatrox immediately began to slaughter them as Tryndamere looked on in horror before raising his blade and attempting to strike. Aatrox swatted the barbarian aside and nearly beat him to death, speaking archaic words and laughing maniacally as he succumbed to his wounds.\nAfter Xolaani achieved a new 3 host in Ionia , Aatrox sensed her reawakening from continents away. Aatrox's hatred for Xolaani burned so deeply that he planned to wage a final war against her to bring him oblivion, rallying the rest of the Darkin to join him in Icathia and battle Xolaani.\nIn Icathia, he faced off against an empowered 7 Xolaani and battled her alongside the other Darkin. However, some of them fell victim to her hemomancy and fought Aatrox against their will. Mihira , the Aspect of Justice, sensed the cataclysmic battle between the two and descended down to Runeterra with her daughter Kayle to intervene. Kayle and Aatrox fought one another while Xolaani somehow managed to use hemomancy to bend even Mihira to her will, seemingly fusing with the 7 Aspect .\nThough the outcome is unclear, its implied that Ryze , who accompanied Kayle on her mission to intervene, decided to utilize a World Rune to completely neutralize the catastrophe.",
    "personality": "As an Ascended , Aatrox was known as an incredibly noble warrior who was loyal to the Shuriman Empire as he didn't hesitate to aid his fellow Ascended during the Icathian Uprising . After facing the horrors of the Void , Aatrox's mind was horribly scarred and he was forever changed by what he faced during the war, seemingly losing his noble nature.\nDuring the Great Darkin War , Aatrox grew violent and mad from the lack of leadership and purpose. He began disregarded mortal life completely, either seeing them as beneath him or simply as soldiers for his armies. Though he was a ruthless and vicious warrior, he still held a sense of comradery with his fellow Darkin, being an honored general among them. Aatrox had an intense sense of hatred for his enemies, especially those he considers cowards or traitors.\nAfter years trapped in a torturous existence within his sword, Aatrox now speaks vicious rage and constant vindication against life itself, loathing his existence and how far he has fallen from glory. Aatrox has grown so desperate to end his suffering that he is more than wiling to commit all kinds of atrocities to achieve a proper end, uncaring of who he kills or destroys in the process. Aatrox has a passion for warfare and battle, constantly taunting enemies and going on tangents about the oblivion he wishes to achieve. Despite this, Aatrox can also speak poetically, especially when reminiscing on his current form and the pain of his existence.",
    "appearance": "Aatrox's consciousness is imprisoned within his sword; a large red blade with sharp spikes and black organic platting that mimics steel. In the center of the blade close to the handle is Aatrox's beating heart, which constantly pulsates with his life force.\nIn his physical form, Aatrox is incredibly large, standing taller than most mortals and capable of increasing his size by repurposing the bodies of his fallen enemies. His skin is a deep red that gets brighter around his chest and he has organic armor covering various parts of his body including his right arm, back, legs, and head. The armor shell on his head forms a helmet with two horns and on his back are two large wings with fleshy membranes that he often grows to raise himself from the ground and intimidate people.\nIt is unknown what Aatrox looked like in his Ascended form, however it is known that he looked similar to his current form with giant golden wings and shimmering armor."
  },
  {
    "name": "Ahri (Character)",
    "url": "https://leagueoflegends.fandom.com/wiki/Ahri",
    "infobox": {},
    "background": "Ahri's earliest memories are of her growing up among a pack of icefoxes in northern Shon-Xan . Though her true origins are unknown even to her, she was accepted by the pack and considered one of them. Though she was a vastaya , she had no knowledge of her tribe except for a pair of sunstones she carried her entire life.\nLiving in the wild among the icefoxes, Ahri began to feel her vastayan abilities surface as she found she was capable of channeling the Spirit Realm within herself, gaining the ability to enhance her in reflexes and control the emotions of her prey.\nAhri often watched humans from afar for years until she found one wounded by a stray arrow. Ahri found she could feel his life force seeping away and followed her predatorial instincts, absorbing his spiritual essence and feasting on his memories, emotions and knowledge on human language. As she grew closer to the fringes of Ionian society, Ahri became addicted to feeding off of the spiritual essence of mortals, becoming drunk on their emotions and stolen memories. Eventually Ahri saw memories depicting how humans perceived her; a terrifying monster. Distressed by this, Ahri tried to stop from feeding on mortal essence but realized her powers slowly faded if she did, deciding to fully embrace her nature as a monster.\nOne day, Ahri met an artist who, instead of running away from her in fear, actually offered his own essence in exchange for her love. For the first time, Ahri felt genuine happiness without having to feed on spiritual essence and the two fell in love. Though Ahri pleaded that she was too monstrous for him, the artist explained that he loved her wholly despite her monstrous nature. The two would often sit by a lake at the edge of Ionia, as Ahri blissfully watched her lover paint pictures of flowers. Unfortunately, Ahri lost control of her ravenous instincts one day and completely drained her lover, killing him. Ahri despaired over this and mourned the loss of the first and only person she truly loved, retreating further even from society.\nGrief stricken over the loss of her lover, Ahri retreated from society and travelled to the Garden of Forgetting . Here, she wished to erase all the troubled memories she stole during her time as a predator, especially those of her dead lover.\nHere she met a mysterious old woman tending to the garden. Ahri recognized this woman as the garden's caretaker, known by names such as the Eater of Secrets, the Forgotten or the Witch Gardener. Ahri referred to her as Ighilya, the Ionian word for \"great grandmother,\" and begged her to show her how to forget the painful memories of her lover. The Gardener warned her that forgetting these memories was a worse fate, but reluctantly agreed to help Ahri, handing her a budding snow lily and instructing her to breath into the flower and think of the memory she wanted to get rid of. The flower, while trying to consume the memory, caused Ahri to relive the death of her lover through painful visions, making Ahri realize that she didn't want to lose these memories of her beloved as removing them was far worse than living with the pain.\nAttempting to pull away, Ahri felt suffocated by the unnatural perfumes of the snow lily and saw hallucinogenic visions appear as a result of it. After hallucinating in the garden, she regained her senses as the Gardener stood above her, asking her if she managed to keep the memory before the flower took hold. Ahri explained that she did, despite it seeming cloudy, as the Gardener quietly urged Ahri to leave the garden before it takes her, as it did with many others who visited it before. As dark vines and snow lilies began to overgrow and cover the exits out of the garden, Ahri managed to escape with her vastayan reflexes and decided that she would from now on live from her past pains and experiences rather than regret and attempt to forget them.\nWishing to find a solution to control her abilities and her predatory instincts, Ahri became consumed with learning more about her origins and her mysterious vastayan tribe. Her travels through Ionia eventually lead her to Omikayalan , the once sacred grove of the God-Willow; a legendary and magical tree that had been cut down thousands of years ago.\nThere she met several spiritual creatures that protected 3 a God-Willow sapling , including vastayan lords such as 4 Himon'she , 5 Gai'sh , 5 the Tail-Cloak Matriarch and a mighty fox spirit named 7 Sai'nen Thousand-Tailed . Here, Ahri learned to embrace her wild vastayan nature, continuing her search for her lost tribe and leaving the sacred grove.\nOn her search for her lost tribe, Ahri travelled to an Ionian market, taking in the new environment. A fortune teller named Hirin approached Ahri and recognized her twin sunstones as the work of a talented artisan named Ymelo. Curious, as these sunstones were her only link to her lost tribe, Ahri asked the fortune teller more details about Ymelo as the two conversed in her caravan. Offering Ahri tea, Hirin proceeded to tell Ahri what she knew about Ymelo, explaining how he was a master sculptor known for collecting fossilized lizard eggs and carving them into intricate shapes. Ahri's sunstones were a very particular beauty to Hirin, as she explained that his stones were typically built to be small pieces fitting into a larger sculpture.\nAs the conversation went on, Hirin pulled out a hunting knife and revealed that she slipped a paralysis potion into Ahri's tea, leaving Ahri unable to move or pounce as her limbs completely froze. Hirin sought to cut off one of Ahri's tails, as they are a useful ingredient for her potions and seen as extremely valuable.\nDespite being paralyzed, Ahri managed to use her soul-devouring abilities to steal essence from Hirin and make herself strong enough to move again. Enraged, Ahri began to devour Hirin's essence, seeing flashes of her memories and witnessing the hardships she faced in life. Empathizing with the fortune teller, Ahri decided to spare her life, devouring the memories of their encounter and leaving Hirin to forget what just happened. Ahri then left the market with a new lead to follow on her quest; the craftsman Ymelo.\nAt some point, Ahri found more clues about Ymelo that required her to travel to the pirate city Bilgewater . In order to do so however, Ahri realized that she needed a bodyguard to escort her overseas. Travelling to Weh'le during a Spirit Blossom festival, Ahri found her self at a local teahouse in search of anybody willing to act as her protector in Bilgewater.\nOverhearing a conversation about Noxian warriors living in the village, Ahri became curious and asked where she can find a mighty warrior like these Noxians to serve as her guard. Paskoma, the teahouse's owner, immediately denied Ahri and refused to allow anybody dangerous to stay in her house, insisting that Ahri leave if she intends to bring in a warrior. Ahri didn't want to stay at a different teahouse and agreed to respect Paskoma's wishes before disappearing into her room.\nDuring the first night of the Spirit Blossom festival, a massive feast was hosted at the teahouse as even Ahri decided to join in on the festivities. During the dinner, Ahri talked with Paskoma's granddaughter Satokka, who mistook Ahri's fox-like appearance as a costume of the Gatekeeper ; a mythological Ionian spirit known for guiding the dead souls during the festival. The two got in a heated discussion over Ionian culture and mythology, most notably about a spirit named the Taker . As Paskoma's spouse Ituren began to serve desert to the teahouse guests, Ahri used her mind altering abilities to convince him to let warriors in the teahouse.\nAt some point, Ahri met Yasuo ; a lone swordsman in search of a purpose outside of Ionia. They both wanted to find things outside of their homeland, so Ahri managed to persuade Yasuo into accompanying her to Bilgewater, officially hiring him as her bodyguard. Though the two set sail and traveled together, Ahri kept her vastayan nature and identity a secret from Yasuo.\nAs the two finally arrived in the pirate city, Ahri traveled to a black market and spoke to one of their vendors. Asking about her tribe, now knowing them as the Vesani , Ahri learned that a Vesani sunstone was recently purchased by a member of the Jagged Hooks named Malik, who was headed towards Grey Harbor. Overtime though, Yasuo grew more frustrated as Ahri refused to explain her mission and reveal her true nature to him. Deciding to search for the pirate tomorrow, the two stayed the night at a local tavern where Yasuo finally deduced Ahri's true nature as a vastaya as she revealed her mission to him. That night, after having a nightmare of her former lover, Ahri feared the same thing would happen to Yasuo and left for Grey Harbor alone, managing to track down and interrogate one of the Jagged Hooks. Here, she discovered that the pirate king Gangplank actually took the sunstone and set off for the Shadow Isles .\nIn pursuit of the sunstone, Ahri traveled to the Shadow Isles by herself, leaving her cloak behind in the forst. Here, she encountered and befriended the nature spirit Maokai , who explained his origins as a spirit that once helped the Blessed Isles flourish with life before the Ruination of Helia . Searching for Gangplank, Maokai revealed that he actually allied himself with the wicked wraith Thresh , using his artifacts to stir the mist and causing it to form impenetrable walls and weaken Maokai by infecting his roots within the Vesani vaults below the isles, who she discovered had traveled to the Blessed Isles long before the Ruination.\nYasuo arrived on the Shadow Isles as part of the crew of the Charming Lady, accompanied by Braum , Illaoi , Pyke and their captain Sarah Fortune . The group faced off against a threatened Maokai before Ahri intervened, clearing the air and explaining the situation that Maokai shared with her. As the crew also wanted to find Gangplank, they realized he would most likely be in Thresh's fortress which was being protected by walls of the Black Mist. Ahri planned on heading to one of the Vesani vaults in search of more evidence, but the others insisted on accompanying her to cleanse Maokai's roots to which she reluctantly agreed.\nThe crew pushed back the Black Mist infesting the vault while Ahri slowly gained more knowledge and clues about her ancestors, discovering that they had a deep connection to the Shadow Isles and created technology based around preserving memories. Though they managed to cleanse Maokai's roots, he would regain his strength slowly and remained too weak to immediately help clear out the mist. Instead, the group planned to travel to a an undersea temple of the Buhru as Maokai gave Illaoi one of his seeds to be blessed by her god Nagakabouros , allowing him to quickly restore his grove and clear out the mist.\nAfter Pyke managed to locate the deep undersea temple and Illaoi convinced the Buhru serpent callers to tame the sea monsters guarding it, the crew traveled into the undersea temple and found a place to purify the seed of the Black Mist and bless it. Ahri, using her powers to aid in the process, nearly lost control of herself due to the Black Mist corruption within the seed before regaining her sanity. With the seed now successfully blessed, the crew sailed back to the Shadow Isles to return it to Maokai.\nOn their way to Maokai's grove, the crew met an undead shade named Necrit , revealed to be the former advisor of Viego , the Ruined King of Camavor . Necrit explains and reveals the true, unknown origins of the Shadow Isles and how it was formed by the broken heart of Viego after the tragic death of his wife Isolde . Finally, Necrit warned the crew that Thresh's grand plan is to use artifacts of power to reawaken Viego from the mist before bidding them farewell and urging them to stop Thresh's ritual.\nWith Maokai reinvigorated by the purified seed, he managed to clear out the walls of mist and expose Thresh's fortress, allowing the crew to enter. Inside Thresh's Library of Agony, Ahri found Thresh's collection of Vesani artifacts, as well as Gangplank's sunstone which she discovered was a vessel used to contain memories. However, the sunstone seemed depleted and drained with only some residual memories of her ancestors. Wishing to examine it more, Ahri took the sunstone for safekeeping. The crew eventually manage to find Thresh and defeat him in battle, returning him to the Black Mist.\nNow searching for Gangplank, the crew travelled to the heart of the Shadow Isles hoping to stop him but arrive too late, as Gangplank has already reawakened Viego. Though he attempted to capture Viego within a Buhru artifact, he fails and becomes possessed by the Ruined King as he flies towards Bilgewater alongside a violent Harrowing in search of his dead wife's crown . Forced to fight the crew under Viego's control, Gangplank was defeated and imprisoned on Sarah Fortune's ship. Meanwhile, Ahri managed to sense something lingering in the Black Mist and receieved visions of Viego's discarded memories, seeing the negative parts of his marriage and learning the truth; that his love for his wife was not as pure as he tells himself.\nIn order to pursue Viego, Yasuo volunteered to channel the wind into the sails and Ahri empowered him with her own magic. While Illaoi interrogates Gangplank for a way to defeat Viego, he reveals that the discarded memories discovered by Ahri would most likely be capable of weakening Viego enough to be defeated. Though they managed to reach Viego, he sends out a gale of Black Mist, shipwrecking the crew on a mysterious island with mystical winds. Here, Yasuo became haunted by visions of his past and confronted a shadow resembling his dead brother . Seeing Yasuo's past play in action, Ahri began to empathize with him and shared her own grief over her dead lover, allowing him to defeat the shadow and overcome his past. The ship is eventually repaired, allowing them to make it back to Bilgewater in time to prepare them for Viego's Harrowing.\nThe crew make a plan to have Ahri weaken Viego with his own discarded memories and imprison him within Gangplank's Buhru amulet, but it had been corrupted and damaged in the fight. Learning about an ancient Buhru forge located underneath the Shadow Isles, the crew plan to take the amulet there to have it repaired. Once they land at the Shadow Isles, they are once again confronted by Necrit, who revealed that the forge is located inside a Vesani vault with more evidence of Ahri's ancestors. Inside the vault, Ahri channeled the memories within her twin sunstones and learned that her people were a nomadic tribe of vastaya that specialized in studying magic relating to memories. Their nomadic lifestyle brought them to the Blessed Isles, where they became allies with the city of Helia and began to study the ethereal Hallowed Mist that once protected the isles, learning to harness its power to enchant golems, technologies and other artifacts such as Ahri's sunstones. The Vesani however became victims of the terrible Ruination of Helia that ultimately created the Shadow Isles.\nAfter finding a facility capable of transferring memories into sunstones, Ahri planned to transfer all the research preserved by her Vesani ancestors into a sunstone and finally achieve the answers she had been looking for. However, she is eventually forced to make a decision; should she use the sunstone as a vessel to hold the memories of her people or to house Viego's discarded memories as a means to weaken him? Ahri, knowing what's at stake for the world, chose to store Viego's memories, causing the memories of her ancestors to fade away. Despairing over the loss, Ahri was suddenly faced with a memory of her dead lover, who forgave her for what she did. He explained that her memories will always be with her, but that it's more important to allow yourself to create new memories rather than dwell on old ones. He urges Ahri to keep fighting and to help save the world before finally fading away as Ahri thanks him for the closure.\nAs the crew managed to find the Buhru forge underneath the vault, Ahri joined the rest of the group as they bore their souls before Nagakabouros herself, battling the goddess's avatar and being found worthy of her help as the goddess cleanses the amulet.\nNow back at Bilgewater, the crew finally battled the Ruined King while Ahri, wielding the sunstone containing his discarded memories, used her magic to weaken Viego, forcing him to remember the twisted parts of his love for Isolde. Once beaten, Ahri hit him with more of his memories, forcing him to relive his death when an angered wraith of Isolde killed him at the Blessed Isles. While distracted, Sarah Fortune used the opportunity to imprison Viego within the amulet. Though he nearly corrupted her soul and tempted her to follow him in the process, she was ultimately successful as the Ruined King was finally banished.\nWith the battle over, Ahri celebrated with her new friends at the Baron's Rest tavern, where each member of the group talked about their future plans now that Viego had been defeated. Ahri revealed that she plans on returning to the Shadow Isles, wishing to see what else she can learn from her ancestors and dedicating herself to living in their footsteps by bringing life and new memories to the world.",
    "personality": "Ahri started out as very savage and impulsive, growing up in the wilds away from civilization and becoming obsessed with consuming the spiritual essence of mortals. As she devoured more souls, she began to feel the emotions of her victims and became more empathetic and reluctant to continue her hunts. After the death of her lover, Ahri became consumed with regret and guilt, completely ashamed of her Vesani nature and distancing herself completely from society, only ever interacting with people to feast on their essence and sate her hunger. Ahri's pain grew so large that she simply wanted to forget all the painful memories, but ultimately decided that these memories were too valuable to let go of learned to carry her memories with her, no matter how painful they are.\nThough deceivingly old and wise with the knowledge of the many memories she had consumed over the years, Ahri carries a youthful demeanor with a witty, mischievous and even flirty attitude. Although she remains somewhat moody and impulsive, sometimes losing control of her ravenous hunger, she has become incredibly empathetic with her abilities to consume emotions, even empathizing with those that would wish her harm. After choosing to cleanse the memories of her ancestors from her sunstones, Ahri found closure with her past and now lives to uphold the wisdoms of the Vesani by looking towards the future and allowing herself to make new memories instead of dwelling on her old ones.",
    "appearance": "Ahri is an attractive female Vesani of medium stature with pale skin and long black hair down to her back tied in a braid with two long strands sticking out on the sides in her face. Her eyes are golden yellow with slit-shaped pupils and her cheeks have red, whisker-like marks on them. Due to her vastayan nature, she has black fox ears atop her head, long claws for nails and nine white fox tails. She usually wears a white dress with red and gold details as well as trinkets such as three purple tassels.\nAt times, usually when hiding her vastayan nature among society to stop from unwanted attention, Ahri wears a giant white hooded cloak to shield not only her face but also her nine white tails."
  },
  {
    "name": "Akali (Character)",
    "url": "https://leagueoflegends.fandom.com/wiki/Akali",
    "infobox": {},
    "background": "Akali was born within the Kinkou Order , daughter to Tahno and Maymm Jhomen Tethi. Maymm was the renowned Fist of Shadow and one of the Kinkou leaders in charge of preserving the delicate spiritual balance of Ionia . As a child, Akali's parents would often be called off on their duties, leaving her under the care of other Kinkou masters such as Master Kusho or Kennen . When in the care of Kennen, Akali would be taught many shuriken techniques and honed her skills in speed and agility. Being a prodigy, Akali showed great promise as a member of the Kinkou Order and woult often train alongside Master Kusho's son and appointed successor Shen .\nDuring the Noxian Invasion of Ionia , Master Kusho's adopted son and former student Zed returned to the order after having left to participate in the war. With an army of his own followers, Zed planned to enact a violent takeover of the Kinkou Order and seemingly killed Master Kusho, transforming the Kinkou into the Shadow Order . Zed and his acolytes proceeded to kill the remaining Kinkou, including Akali's father Tahno. Luckily, Akali fled to a long-abandoned temple in the eastern mountains alongside a small group of other Kinkou consisting of her mother Maymm, Kennen and the new Eye of Twilight , Shen.\nIn the mountains, Shen began rebuilding the Kinkou Order by returning to its three fundamental philosophes: the pure impartiality of Watching the Stars , the passage of judgment in Coursing the Sun , and the elimination of imbalance by Pruning the Tree. As Fist of Shadow, Maymm's duty was in Pruning the Tree, training Akali and several other neophytes to become assassins that would kill those that would threaten the balance. By the age of nine, Akali became close friends with another neophyte name Faey, Maymm's young apprentice and possible successor. Though Akali was skilled, she was often impatient and rambunctious, often causing trouble for Faey and the neophytes due to being the youngest of them.\nWhile training and playing games, Akali and the rest of the neophytes encountered a band of warriors from the Navori Brotherhood , an Ionian nationalist faction formed in the aftermath of the Noxian invasion currently searching for people to forcefully recruit into their army. Akali and the group of neophytes hid in the trees, not wanting to lead the brotherhood back to their Kinkou temple. Using a variety of tricks and traps, they managed to scare the warriors away by convincing them that the forest was cursed.\nIn the process, the group accidentally angered a corrupted nature spirit that began rampaging and entrapping the neophytes in vines. Faey quickly tried freeing them while Akali helped, against Faey's orders, by hastily running circles around the spirit, distracting it. While Akali dragged some of the neophytes to safety, Faey was suddenly struck by the spirit and fell to the ground, becoming gravely injured and breaking her leg. At that moment, Maymm, Shen and Kennen arrived just in time to dispel the spirit and save the children.\nBack at the temple, Akali was praised by her fellow students for her speed in saving them. When Faey woke up, she realized the severity of her injuries as she was missing a leg and unable to walk. When Akali tried to comfort her, Faey snapped at Akali, blaming her and angered by the fact that she disobeyed her orders. Hearing her distrss, Maymm enetered the room and comforted Faey, vowing to find a way to heal Faey's leg and allow her to walk again so she can fight alongside her as her apprentice once again. Akali, overhearing the conversation, saw the kindness Maymm harbored for Faey and tearfully walked off.\nAt the age of fourteen, Akali formally entered her Kinkou training, determined to eventually succeed her mother in becoming the new Fist of Shadow. Though she possessed no magical talents like the other acolytes who would fill her role, she proved her worth of the title by sheer skill. Soon, Maymm stepped down from her role as Fist of Shadow and focused on mentoring the other neophytes, officially granting Akali the title as her successor.\nAs the Noxian Invasion ended and the Shadow Order reached an uneasy accord with the Kinkou, Akali slowly saw the suffering her people still endured. She began to question her purpose as the Fist of Shadow and whether or not she was truly fulfilling her duties in Pruning the Tree . Shen would constantly urge restraint, teaching her meditation techniques and mantras to tame her spirit. However, Akali believed Shen was holding her back, constantly arguing and defying him as she took down Ionia's enemies in her own way.\nFinally growing sick of Shen's views on Ionia's balance, Akali insulted the entire order by declaring their impotence, claiming their lack of action in favor of spiritual balance has lead to more Ionians suffering in the Material Realm. Akali officially left order, discarding her title as Fist of Shadow, while Shen let her go without arguing. Shen believed that this was a path that Akali must walk alone with hopes of her returning to the order one day, though he knows that is a decision only she can make herself.\nNow living as an independent assassin, free from the restraints of the Kinkou Order's teachings, Akali lived as a vigilante, traversing the urban underground of Ionia and killing those that cause her people harm.\nIn the coastal village of Weh'le , a hidden phantom port with mystical properties, Akali went on a mission to assassinate a councilman from Puboe who had sold out his own people to Noxian invaders in exchange for gold and safe passage through. She visited her tattoo artist Bo'lii, a vastayan artist who ran a tavern in the port. While drawing a tattoo of a dragon on her back, the Puboe councilman walked into Bo'lii's tavern accompanied by three guards. Akali planned to kill them on the spot, but Bo'lii urged her to do her business outside of his tavern this time, to which she agreed. Once outside, Akali approached and killed the councilman's guards by hiding in a smoke cloud and firing several kunais before finally killing the councilman himself.\nDespite being an independent assassin and having left the Kinkou Order, Akali still retained a close relationship with Shen, who continued acting as her mentor. One day, the two came across a Noxian boy in the Navori province cutting wood from a Guardian Tree . While Akali plans to punish the Noxian with brute force, Shen suggests she finds a different approach. As the Noxian loaded up his cart, Akali arrived and broke the wagon's wheels with her shuriken, discovering that the Noxian is actually a young boy to Akali's surprise.\nAs the sap of the Guardian Tree began to flow into a shrine, it awoke its protector; a large stone guardian that slowly walked towards the Noxian boy. By granting Akali his ability to see into the Spirit Realm , he revealed to Akali that the protector was powered by the anger of the forest, seeking to restore balance and avenge the Guardian Tree by killing the Noxian boy. Against Shen's wishes, Akali rushed forward and attacked the protector with little to no effect. While trying to lift the wagon off of the Noxian boy, Akali realized that the only way to restore the balance is if the boy planted a new tree in its place. By taking a seed from a nearby branch, Akali had the boy plant the seed into the ground before Shen used his spiritual powers to instantly grow the seed into a sapling, taming the stone protector. Lifting the wagon off of the boy, Akali gave him a warning not to harm the land as Shen used his powers to grow the sapling into an even larger Guardian Tree, wrapping itself around the shrine guardian.\nIn Zhyun , Akali got word that Zed recently assassinated the Kinkou master Althon, a cousin of Shen. Finding Shen in the Olgathee Forest killing corrupted spirits, Akali told him the news about master Althon, stating that she knows the town that Zed is staying in and suggesting she and Shen go confront him, which he reluctantly agrees to.\nOnce at a tavern in Thonx , the two found out from the innkeeper that Zed had already left and attacked a blossom festival before heading north to Shual . Akali suggested they follow him, but Shen stated that he had to travel south to slay demons that have been terrorizing a village. Akali tried to convince Shen to follow her to Shual, but Shen remained dedicated to his duties as the Eye of Twilight, urging his former student not to chase Zed alone. Akali, disregarding Shen's warning, took a boat and sailed down the quickest route to Shual.\nTravelling to an inn near the Kinkou temple of Koeshin, Akali found a group of Zed's acolytes disguised as Kinkou, including Zed's apprentice Shieda Kayn . Kayn told Akali that their masters were inside the inn while Akali threatened them by calling a group of Kinkou warriors to defend the temple. Zed then exited the inn followed by Shen, who ordered Akali to let the Shadow Order walk free since Zed declared the Code of Tuonn, an honorable call for temporary peace that allows them to let each other walk free without combat. Akali however wasn't satisfied with just letting Zed go and dashed in to kill him anyway, which Zed easily avoided by shadow shifting away while the rest of his acolytes quickly fled the Kinkou temple. Angered by Akali's recklessness, Shen told her never to fight Zed and that he'll fight him alone in the future, officially declaring that the armistice between the Shadow Order and the Kinkou has ended.\nShen eventually revealed to Akali what transpired in the inn; Zed came to warn Shen that the serial killer Khada Jhin had escaped and that he seeks to bring him back to prison. Though Zed wanted to ally with Shen and capture Jhin, Shen refused and insisted on catching Jhin on his own without the help of the Shadow Order, declaring that if he sees Zed interfere then he'll personally kill him and finally settle their scores.\nAkali followed Shen as he investigated a trail of intricate clues in search of the murderer Khada Jhin. Shen's investigation eventually lead him to believe that Jhin was working with the Kashuri faction , a radical nationalist group with ties to the Navori Brotherhood. This trail lead Shen to Nanthee , believing that the village elder was a potential target of Jhin's murder spree. Once at the scene of the crime, Shen stopped Akali from looking at the corpses, stating that she simply isn't ready to see the horrors that Jhin committed.\nEventually, Jhin's traps activated as dozens of bombs hidden in lanterns across Nanthee began exploding, killing many and causing massive damage to the city. Akali, noticing the explosion from afar, vows to kill Jhin for what he'd done. Noticing a small ship in the distance and deducing that that's where Jhin was escaping, Akali demanded to know where it was headed, learning that it was headed to the Piltover .\nDeciding to follow Jhin's trail alone, Akali set sail and eventually landed in Piltover. On her search for Jhin, Akali questioned and interrogated many of the locals, which lead her to the undercity of Zaun . In Zaun, she learned that Jhin had been attacking Piltover merchant clans that did business in exporting weapons to Ionia. By questioning the Piltover enforcers, Akali found herself at a theater in the Zaunite neighborhood of Mistfloor, where Jhin was said to have battled with the Ferros clan and their intelligencer agent .\nAt the theater, Jhin revealed an elaborate trap for Akali, wishing to make her the fourth victim in his disturbing art piece as three piltovans hung from Ionian trees strapped to machines. These machines began firing harpoons at Akali, who narrowly dodged them by tossing a smoke bomb before being hit unconscious by an explosive blast created by Jhin's rifle .\nJhin, having anticipated Zed and Shen's arrivals, set a trap by tying Akali up in a tree near a decoy of his. While Jhin tried to kill the two of them with Zaunite machinery, Zed managed to toss a shuriken at Akali, cutting her rope and freeing her from Jhin's trap. While Jhin was ready to fire a shot into Shen's head, Akali burst out of the smoke and punched Jhin to the ground, grabbing his gun and preparing to kill him for his crimes while Shen pleaded for her not to as he needed to bring Jhin to Ionia alive. Before she could kill him, Zed pushed her aside and grabbed Jhin, demanding he tell him how he got out of prison. Jhin simply replied with cryptic riddles, stating that Zed already knew who freed him before Zed threw Jhin to Shen and Akali's feet, stating that their bargain is done as he quickly fled Zaun.\nAt some point, Noxus began a second incursion of Ionia, sending massive armies accompanied by the undead juggernaut Sion . When the Ionian war hero Irelia began a resistance, she requested aid at a seaside village and received assistance from Kinkou members lead by Akali and Kennen , the spiritual leader Karma and the lone wanderer Yasuo . During the defense against the Noxian army, Akali targeted Sion and struck him with her kama and smoke bombs before joining Irelia and the rest of the champions in a final charge against the Noxians.",
    "personality": "Akali is impatient, explosive and determined, preferring to leave the Kinkou Order rather than betray her own ideals and not fight for her people. It is notable that, despite this, she is still loyal to Ionia, being able to do anything, even to become a murderer, to protect the First Lands and her home.",
    "appearance": "Akali is a slender but muscular woman with light skin and red-brown eyes. Her thick black hair is often tussled, tied back in a large, messy bun which flares in every direction. She also has a tattoo of a pale blue dragon among white clouds swirling around her arms and across the backs of her shoulders.\nHer typical professional attire is various shades of green with brown leather highlights. She wears baggy pants, a crop top, tabi, and a cloth mask that covers her lower face."
  },
  {
    "name": "Akshan (Character)",
    "url": "https://leagueoflegends.fandom.com/wiki/Akshan",
    "infobox": {},
    "background": "Akshan grew up an orphan in the Shuriman city of Marwi, where brutal warlords ruled by subjugating the civilians and taking what they wanted. As a young boy, Akshan refused to let these misdeeds go unnoticed and often intervened at the sight of injustice. This eventually lead to Akshan making enemies with powerful warlords who eventually beat him to near-death, leaving him unconscious and dying on the street.\nAkshan was soon found by an elderly woman named Shadya, who took him into her home and miraculously nursed him back to health. While staying with the old woman, Akshan discovered Shadya was a member of the Sentinels of Light ; an ancient order dedicated to protecting the world from horrors of Undead . Despite his shortcomings as a stubborn and troubled youth, Shadya saw immense potential in Akshan due to his dedication to fighting injustice. Shadya offered to allow Akshan to safely live with her and in exchange he'd dedicate himself to the Sentinels of Light order, which Akshan happily agreed to.\nShadya and Akshan formed a fast bond, as Shadya mentored Akshan everything she knew to survive as a solo Sentinel. As Akshan's Sentinel skills grew under Shadya's tutelage, he slowly noticed his mentor growing more distant. When the time came, Shadya finally revealed to her pupil the source of her concern, that a Harrowing was coming, larger than the world had ever seen with an army of undead from the Shadow Isles . Shadya stated that their only hope in defending against this future threat is laid in a collection of ancient Sentinel weapons buried in Shurima's crypts and tombs. However, they would find most of their weapons gone, pilfered by local warlords who sought to unlock their powers for themselves. The Sentinels would try to negotiate the return of their weapons, but to no avail. With time running out, they would have to make do with what they had left.\nAs they took stock of their remaining arsenal, one peculiar relic gun would catch Akshan's eye, but it was quickly snatched away by Shadya, who forbade him from ever using it. This weapon was known as the Absolver, a gun that was enchanted to revive anyone who was recently killed by someone, if it kills its target. Shadya believed that only fate should wield the powers of life and death, but Akshan disagreed, believing that fate needed a little help. Akshan continued to pry for more information about the weapon until Shadya revealed the truth, she had used it to revive the young sentinel. Shadya once wielded the Absolver and slayed Akshan's would-be murderer many years ago, restoring him to life. The revelation would cause Akshan ponder what had made him so worthy of being revived. While Akshan questioned the antiquated rules of his order, Shadya continued to press the warlords to return their weapons, leading to tensions between the two groups.\nThings would come to a head on one tragic day, when Akshan would find Shadya murdered on the streets. After burying her within the sentinel base of Shurima, Akshan would disregard his late-mentor's wishes and armed himself with the Absolver, after making a few modifications. Filled with vengeance, Akshan decides to abandon the sentinel's cause and prepares for a new mission: to avenge his fallen teacher. He now hunts for his mentor's killer, delivering comeuppance to one warlord at a time.\nThe great Harrowing would soon arrive, blanketing the world in Black Mist. Lucian and a Sentinel Rookie would come to the Shuriman Sentinel base in search of the Absolver. The two would encounter Akshan, who explained what had happened to Shadya and his mission to bring her back. Akshan then departed to hunt down another warlord. The two Sentinels followed Akshan to the warlord's compound and watched the Absolver in action. After dispatching the warlord, the trio raced back to the base to see if Shadya was resurrected. When they find her body still lifeless, Lucian tries to recruiting him, but Akshan remains undeterred, and leaves to face another warlord.\nAs the two Sentinels prepare to return to headquarters, they notice that Viego is in the town below, searching for another fetter. As they confront the Ruined King, he unleashes an army of ghouls against them, making short work of the sentinels. As they lay dying, Akshan returns, having had a change of heart, and quickly dispatches the ghouls and takes their bodies back to the base. The two reawaken, realizing they were revived by the Absolver. Finally understanding Shadya's life goal was the sentinel's cause, Akshan finally agrees to join them and returns to Sentinel headquarters. Senna scolds Lucian and the Rookie for leaving in the middle of night for a secret a mission and at Akshan for his dress code violations.\nAkshan joins the rest the Sentinels and Gwen as they mount their final assault against Viego on the Shadow Isles. As Senna draws out Viego, the Sentinels ambush him. Viego quickly turns the tide of the battle and quickly dispatches Senna and Gwen and creates a portal to Camavor and takes the fetters through. Akshan manages to slip through the portal as well and tries to take Viego out with the Absolver, but soon realizes his weapon is ineffective against the Ruined King. However, he is prompted by the recently revived Queen Isolde to shoot her instead, and he fires at the queen, returning her to eternal rest once again. With Isolde gone, Viego begins to weaken and Senna and Gwen are brought back to life. With their combined efforts, they manage to defeat the Ruined King and imprison him with Hallowed Mist.\nThey return to the Shadow Isles and reunite with their allies until they sense another dark presence approaching. Thresh arrives and reveals that he is now unbound from the Shadow Isles. He demands one of their souls in exchange for Senna's escaping, or all of their souls if none comply. The Sentinels try to resist him, but he proves too powerful. The Rookie offers their soul to Thresh instead, but as he prepares to harvest soul, the Rookie unleashes their wayfinder and teleports everyone back to headquarters instead. With Viego defeated, Akshan decides to return to Shurima and continue to honor Shadya's legacy.\nAfter returning to Shurima, Akshan begins to forget his mentor and tries to find mementos to keep her memory alive. One day he recognizes a peculiar bracelet on the arm of a street urchin, realizing it once belonged to Shadya, he interrogates the child. The young girl reveals that she stole it from one of the warlords, determined to reclaim his master's lost jewelry, Akshan prepares to confront the warlord. Later that night, Akshan sneaks into the warlord's palace and holds him at gunpoint, demanding a confession. The sentinel orders the warlord to admit that he killed Shadya, after finding the rest of her jewelry in his possession, but he refutes the claim and asks what he really wants instead. Taking a second to ponder the question, Akshan realizes he wants peace and executes the warlord.\nAs Akshan walks back to city, his memories of Shadya continue to fade. He knows that she would not have approved of him killing the warlord out of vengeance, but he had done it for himself, yet it did not grant him the peace he desired. Looking towards the bracelets for solace, he notices an inscription on one of them, an old sentinel mantra: \"Give all, and all may live.\" The sentinel suddenly has an epiphany and fires his grappling hook, he swings from building to building until he finds his target, the urchin from yesterday. He finds the young girl sleeping in an alley and wakes her, he then offers her Shadya's remaining bracelets, knowing it is what she would have wanted. Despite parting with the last remnants of his mentor, he now has the peace he was looking for, knowing Shadya would approve.",
    "personality": "Akshan is a charming young man who carries himself with confident swagger, boasting about his own abilities and quipping about his enemies. Underneath his usual charismatic demeanor, Akshan wishes to get revenge on those who wrong others, to the point where he prioritizes his own thirst for vengeance over his allies' wishes. Although he is unsure of whom killed his master, he has decided to kill all of the warlords not just as a trial-and-error method to bring Shadya back, but also to get revenge on all of them for getting away with their injustices.\nIn spite of this, Akshan favors justice at heart, and fights to defend people who can't defend themselves, and his resolve prevents him from losing his morals and letting his vindictiveness get the better of him. He cares about his master Shadya the most, and ultimately wants to bring Shadya back to life.",
    "appearance": "Akshan is an attractive young man with olive-colored skin, brown eyes, a short beard, and long, dark chocolate brown hair. He mainly wears a cloak with the emblem of the Sentinels of Light, wears no shirt and exposes his bare chest, wears black pants, black boots with gold stripes, and has several Shuriman amulets on his arms and hands."
  },
  {
    "name": "Alistar (Character)",
    "url": "https://leagueoflegends.fandom.com/wiki/Alistar",
    "infobox": {},
    "background": "Alistar grew up in the Minotaur clans of the Great Barrier mountains. Historically, these Minotaurs protected the overland trade routes to Zaun , gaining a fearsome reputation as strong beasts but preferring to to avoid Valoran's wider political conflicts.\nAlistar was known as a noble warrior and respected among all the clans. Despite this, he always urged his kin to forge greater bonds with the other races, wishing to reach out to them. Unfortunately, most civilizations saw Minotaurs as nothing but beasts and monsters, souring their relations with outsiders.\nWhen the Noxian empire came to the Great Barrier, they requested a parley with representatives from the Minotaur clans. The emissary of Noxus, a matriarch of House Tewain, stated that the empire was preparing to take the eastern coastal city of Basilich and could not go through with it without the support of the Minotaur clans. While many of the Minotaurs were eager to accept her offer and join Noxus, seeing this as a way to gain power and recognition, Alistar remained skeptical. Having encountered Noxian scouts previously, Alistar knew them to be duplicitous and cunning people, and so was incredibly distrustful of the potential invaders. Hearing Tewain's call for support from the Minotaurs, Alistar's clan sent him and fifty of their mightiest warriors to personally meet the matriarch and reject her alliance on behalf of the clan.\nWhen Alistar arrived to announce his clan's position on the issue, he discovered that most of the larger Minotaur clans had already pledged themselves to Noxus. Now seeing Alistar and his clan as opposition to the Noxian empire, the clan representatives betrayed Alistar, attacking him and his warriors for their new Noxian masters. In the swift and brutal battle, Alistar managed to kill many of the Noxian soldiers and traitorous Minotaurs, even choking the life out of Lady Tewain. Despite this, Alistar and his surviving warriors were captured and relocated to the the Noxian capital, accused of the crime of inciting rebellion within the empire.\nCast as Reckoners in the arenas of the city, Alistar and his warriors became part of a gruesome, bloodthirsty event called the Fleshing; a twenty-one day festival of non-stop fights within the Reckoners' arenas. Despite telling his warriors to not fight back and sate the bloodlust these Noxian spectators wanted to see, Alistar became the last of his tribe standing by the end of the festival. Afterwards, Alistar was constantly hated and feared by the Noxians, forced to fight and act like the beast they all assumed he was. Driven to madness, Alistar began to accept the bestial nature these Noxians forced on him, losing memories of his own home with every gruesome kill.\nOne day Ayelia, a servant girl in one of the arenas, visited the infamously savage Reckoner in his cell. He bellowed and charged the bars of his cage, expecting her to fear or goad him like every other visitor he'd had, but Ayelia instead treated him with the first act of kindness Alistar had seen in many years. She returned every day and spoke to him with gentle respect until Alistar managed to reply, revealing the true kindness in him that the Noxian spectators never seen. Through their many talks, Alistar sympathized with Ayelia as he learned that her homeland, much like Alistar's, was also claimed by Noxus. By seeing Alistar's suffering as an enslaved Reckoner, Ayelia had finally been convinced to leave the city and planned to take Alistar with her. While formulating a plan to escape, Alistar's memories of his home began to return to him, remembering the home he wished to return to instead of the awful betrayal by the other tribes.\nAyelia brought Alistar the key to his cell, beginning their escape plan. They hurried to a river where a cargo barge awaited them, ready to sail them away from the city. Unfortunately, Noxian agents burst from the shadows just as they boarded and began to attack. Eager to protect his only living friend Ayelia, Alistar hurled himself directly into battle but became, once again, lost in his own rage and bloodlust. Ayelia constantly called out to Alistar to calm him down and escape with her, but he was too blinded by his rage to hear or notice her calls.\nBy the time Alistar had slain the attackers, the cargo boat had already left and Ayelia was missing. Now without the boat, Alistar fled south on foot instead in search of Ayelia, fearing she had been captured or killed.\nWeeks after Alistar's escape, a political coup lead by the disgraced general Jericho Swain shook the empire to its core, leading to massive reforms in the political structure of Noxus and the culture of the Reckoning arenas. Because of this, the event of Alistar's violent escape from the arenas was mostly forgotten.\nAlistar continues to travel alone through Noxian territories as quietly and subtley as he can in fear of being found out for his crimes. In every city, Alistar incites rebellion and fights to protect the people oppressed by the cruel Noxian regime. With every act of kindness he shows the downtrodden of these territories, Alistar hopes to clear the shame he feels from the horrific acts he committed as a Reckoner. In every city Alistar passes through, he asks for Ayelia, continuing his search for the servant girl responsible for freeing him all those years ago.",
    "personality": "Alistar is a fighter, and his goal is to fight against Noxus in the name of all he has lost and all those that have lost much too. He is angry, wanting Noxus to fall and inciting rebellion in Noxian territories. Despite this, Alistar has a kind heart, and is intent on finding Ayelia at all costs, as she was one of the few people who showed kindness to him.",
    "appearance": "Alistar is a purple skinned Minotaur with blue tufts of hair, blood red eyes, and large white horns atop his head. He is gargantuan and very muscular even by Minotaur standards, with a notably large torso and giant fists. He wears nothing but a loincloth around his waist and broken chain cuffs around his wrists."
  },
  {
    "name": "Ambessa (Character)",
    "url": "https://leagueoflegends.fandom.com/wiki/Ambessa",
    "infobox": {},
    "background": "When Ambessa was ten, her father brought her to the aftermath of the Battle of Hildenard to collect weapons from the fallen in exchange for a gold coin each, exposing her to death at the tender age. Even at her young age, she realized death was not just something to be feared but also to be respected. As she grew up, she chose a soldier's life, quickly rising to the ranks to become a general in command of several warbands. She became a mother of her firstborn son, Kino. While she loved him greatly, she realized he would never have the strength of a warrior in his heart.\nNot long after the birth of Kino, Ambessa almost met her end in defending her ancestral home of Rokrund. As she lay among the bodies she was discovered by a lone wolf who gave her visions as she drifted near death, which miraculously brought her back to life. The visions that Ambessa saw that day had strengthened her resolve and ambition: She would bend the world to her will so that any weakness her children might have could not be exploited. When her grandfather, Menelik Medarda, passed away, he had named no heir. Several branches of the family had vied for succession, however they were all outmatched by Ambessa. She vowed to forge a legacy worthy of the Medarda name.\nShe tried to imbue the same principles in her two known children, particularly in her daughter Mel , whom Ambessa tried to mold into a warrior and leader willing to do whatever is necessary to ensure their survival from a young age. This seemingly proved futile, however, as her son Kino preferred diplomacy and dismissed war as \"A failure of statecraft\", and Mel adapted his way of thinking, considering war and killing only as a last resort.\nEventually, she sent Mel away from their home to Piltover , pointing out that her sentimentality would work well among the \"soft-spined idealists\", and would later use the excuse that it was for her to oversee their family's interests in the city. In truth, she sent her away because she could no longer bear Mel's disapproval of her decisions.\nAs an old guard of Boram Darkwill's regime, she disapproves of Swain's rule and his Triferian council, citing his rule is weak. Furthermore, she is known to look down on Darius as she often refers him as a witless brute. Despite this, she had shown to have genuine respect toward Swain and even called him as \"a true general\" unlike Darkwill. Therefore, it is possible that she seemed to only dislike how he ruled Noxus.\nSometime in the past, she encountered a warrior girl named Rell and was impressed with her fighting capabilities that she decided to take Rell in as a protege and part of her warband. During the battle between Ambessa and her niece, Rell magic surfaced and she helped Ambessa defeated her niece and her forece. Ambessa demanded Rell to kill her niece as a test of loyalty, which Rell complied. However, before Ambessa could officially inducted Rell into her force, Leblanc snatched Rell from her and Ambessa lost her greatest protege back then.\nMel eventually came to power in Piltover as a Councilor and the wealthiest person in the city, and she would later sponsor the research of Jayce Talis , whose Hextech enterprise revolutionized trade and travel around the world; thus having a hand in Piltover's undeniable progress.\nApparently too distracted to have been able to do anything at the time, her son Kino was killed by a powerful man who Kino offended. Ambessa realized that the man was not done with his grudge and would strike again and could have enough resources to potentially overpower the Medarda family. To aid their victory in a potential war, Ambessa visited Piltover in hopes of getting her hands on weaponized Hextech.\nHaving heard news of the city's ongoing conflict with Zaun , she tried to convince both Mel and Jayce to finally engage the undercity in war and use his Hextech weapons for it. Mel determinedly refused and convinced the Council to avoid any war-inciting actions as well, but Jayce was swayed enough to attack one of Silco's Shimmer factories with Vi . When Jayce accidentally killed a boy, however, Jayce completely changed his mind.\nMel confronted her about her manipulation of Jayce and she finally told Mel about the impending conflict with Kino's killer at Noxus. She then asked Mel to let the war happen, after which she would be welcome back home and at her side. Mel would ultimately turn down the offer, taking off her family ring as she agreed to Jayce's proposal of peace with Zaun by granting them their requested independence.",
    "personality": "Ambessa is a confident person, showing no shame or emotional weaknesses. Merciless to her enemies, she prefers aggression over passivity due to the way her father brought her up and the Noxian culture she was raised in. Accompanying her ruthlessness is brazen indulgence, freely enjoying the decadence of Piltover and the local cuisines of foreign lands. Eloquent and well-versed, particularly in military history, she is as capable of manipulation as she is capable of violence, so long as it serves her, and her familys, interests.\nDespite her relaxed stance on using violence, Ambessa does not appear to disregard diplomacy entirely, as despite Kino adopting a purely diplomatic philosophy, Kino was not exiled like Mel was. Additionally, Ambessa is selective with her violence, expressing a readiness to kill one if it means avoiding a larger conflict in the future. She is a survivalist above all else, willing to do whatever it takes to protect her clan, and more importantly, her family.\nAmbessa is one who respects aggression in any form, either in diplomacy or in war, but she also values cunning and guile, so long as it does not detract from a show of force. Ambessa describes this to Mel as a need for her to embody \"both the fox and the wolf\". Although one can embody an aspect of one or the other, one cannot succeed in her family without embodying both, but the most atrocious offense to her is a showcase of weakness and ineptitude.",
    "appearance": "Ambessa is a muscular, brown-skinned woman with light brown eyes. She has coily hair in varying shades of grey to black, worn loosely above the shoulders. She wears Noxian styled clothing befitting her rank, mostly made up of black and red colours, with metallic silver elements, and a red cloak with black fur worn to one side. She is shown to have numerous battle scars on her face and upper body."
  },
  {
    "name": "Amumu (Character)",
    "url": "https://leagueoflegends.fandom.com/wiki/Amumu",
    "infobox": {},
    "background": "Stories about Amumu have circulated around Shuriman culture for centuries but his true origins are an enigma and the subject of debate. Shurimans have told countless origin stories about Amumu but the validity of these tales is uncertain as nobody can agree on a single story. Some people claim that Amumu was a young undead prince while others claim he's a wandering spirit , but the most likely explanation is that Amumu is actually a Yordle who has embedded himself into Shuriman culture, though even this isn't wholly agreed on.\nBecause Amumu has been a staple figure in Shuriman culture since ancient times, there are countless different stories that mention him throughout history. These stories vary in many ways but one detail is universally seen throughout all of them; Amumu is a mummy cursed with eternal loneliness due to his deadly touch and forced to eternally wander the desert in search of a friend.\nOne of the legends about Amumu connected him to the first ruling family of Shurima, claiming that they were struck by a terrible disease that forced Amumu to quarantine in his chambers. Hearing Amumu's weeping through the walls, a servant girl would often visit Amumu and eventually befriended him, bringing courtly news and tales about her mystic grandmother.\nOne day, the girl brought news that Amumu's eldest brother had died from the illness, making Amumu the official emperor of Shurima. Pitying him for enduring this news alone, the servant girl decided to go into his chambers and comfort him. As Amumu embraced his friend, he realized that his touch had infected her with the same blight that killed his entire family, causing her to die. On the day of her death, the girl's grandmother became enraged and placed a terrible curse on the young emperor, trapping him in a permanent moment of suffering for eternity.\nAnother tale depicted Amumu as a young and cruel emperor who forced his subjects to worship him like a god. The young emperor sought the legendary Eye of Angor, an artifact believed to grant eternal life whoever gazes at it with an unflinching heart. For years Amumu hunted for the relic, being carried by a host of slaves through dangerous catacombs as they were forced to sacrifice themselves to deadly traps under Amumu's command.\nWhen Amumu, borne by his slaves, finally reached the room containing the Eye of Angor, the emperor immediately rushed in to gaze at the artifact. Seizing their opportunity, the slaves escaped and sealed the doorway, trapping the child emperor in darkness. The young Amumu endured darkness for years to the point of insanity as he clawed at his own skin, covering the wounds with bandages. Amumu's life was extended by the Eye of Angor, allowing him to reflect on his past transgressions, but was cursed with eternal loneliness in the process.\nAfter a series of earthquakes shattered the tomb's foundations and opened its doors, Amumu emerged, now completely wrapped in bandages and seeking redemption for the suffering he caused as emperor.\nOne of the most peculiar stories of Amumu claim that he was the first and last Yordle ruler of Shurima. Amumu, being a firm believer in the goodness of the human heart, sought to prove his point and swore an oath to live as a beggar until he made one true friend, convinced that his people would rally to help him. Despite thousands passing him by however, nobody extended a helping hand to the impoverished Amumu as he eventually died of a broken heart. Some say that the Yordle did not truly die however, believing that he continues to wander the desert for eternity, hoping to find someone who can restore his faith in humanity.\nThe legends of Amumu still endure in modern Shurima, even after the death of the last emperor Azir . It's widely believed that Amumu still wanders the desert as his cries echo through the winds while he despairs over his inability to find friendship. Some claim that they have actually encountered the mummy, stating that his very presence brings death and illness at the touch. A song known throughout Valoran as The Curse of the Sad Mummy details Amumu's loneliness as he travels the world in search of a friend. By the end of the song, it's said that Amumu's fragile soul couldn't bear the curse anymore as he unleashed a destructive tantrum, destroying the town as he was tragically left alone once again.\nThough its unclear what Amumu is looking for, whether it's redemption, companionship or just a simple act of kindness towards him, his quest remains unfulfilled as he continues to shamble around the sands aimlessly.\nThough many still claim to encounter Amumu to this day, one storyteller named Khaldun stated that he stumbled upon Amumu's tomb after it cracked open during an earthquake. Traversing the tomb, he saw wall carvings that detailed Amumu's life with images depicting a young boy sitting atop the Shuriman Sun Disc and another carving depicting his deathbed being surrounded by people either mourning or celebrating.\nAfter hearing the wails of what he thought was a lost child, he stumbled upon puddles of salt water , which he thought was impossible to find so deep underneath the deserts, and eventually Amumu, who hid himself in the shadows and refused to come out. Khaldun felt pity for him and asked if he was lost while Amumu simply replied that he was unsure of where he was or how he got there, having lost his memory over the thousands of years. Khaldun approached closer to comfort him until he realized that the young boy was in fact a mummy. As Amumu's bandaged hand grasped onto Khaldun's arm, he asked if he could be his friend while Khaldun looked at his arm in horror, watching it rapidly decompose to the point of completely falling off.\nKhaldun quickly fled the tomb out of fear, leaving it open and supposedly releasing Amumu to wander the desert. Though the validity of this story is in question, Khaldun lived to tell this story to his grandchildren as an explanation to why he is missing an arm.",
    "personality": "Because of his curse, Amumu is doomed to an eternity of anguish, despair and loneliness. Because of his deadly touch, Amumu is incapable of embracing or befriending other people, forced to wander the deserts in a constant search for a true friend and wailing as he does so.",
    "appearance": "Amumu is short in stature, about the size of a young child and completely covered head to toe in dark green bandages. He has a permanently despaired facial expression as his yellow eyes constantly tear up as he cries."
  },
  {
    "name": "Anivia (Character)",
    "url": "https://leagueoflegends.fandom.com/wiki/Anivia",
    "infobox": {},
    "background": "Anivia is an ancient demi-god who represents the eternal cycle of life, death, rebirth and the changing of the seasons. She, along with her many siblings, sprung from Runeterra during its formation and together they began to forge the lands of the Vorrijaard itself. Anivia's birth in particular is believed to have brought the first winters into the world, with some even claiming she is responsible for creating True Ice .\nWhen the first mortals arrived in the ancient Vorrijaard, Anivia welcomed them willingly. Witnessing their fragility to the cold weather, she sheltered and guided them to secluded valleys where they would establish their own tribal communities and harden themselves to the elements. While nurturing and watching over these tribes, the mortals would come to revere and worship her and her siblings as gods. Legends state that, though she hoped that these tribes would remain united, blood-feuds and infighting made them susceptible to a massive invasion from a greedy king in the south who marched through the mountains seeking to claim the wild magic of the Vorrijaard for himself. Anivia, angered by the outsiders, summoned a massive snowstorm that lasted a century, obliterating the ancient army.\nA young mortal woman named Lissandra , alongside her two sisters Avarosa and Serylda, sought to harness the magics of the world and claim dominion over the entire Vorrijaard. In order to do so, each sister scoured the world for ancient powers to harness with Lissandra seeking to tame the wild magic of the land itself. Anivia's brothers Valhir and 8 Ildhaurg however grew angered by Lissandra's defiance and sought to destroy the three sisters for their transgressions. Anivia however, alongside her other siblings, was more inclined to work with the sisters rather than declare a war.\nAfter the eldest sister Lissandra made a pact with otherworldly masters , these three sisters would form a mighty alliance and lead a horde of warriors called the Iceborn . These powerful mortals were attuned to elemental magics of the ice, capable of wielding and utilizing the True Ice substance and practically immune to the frigid cold of the Vorrijaard, now called the Freljord .\nAs Lissandra and her sisters gained power and marched with their armies, they slowly erased the influences of the Freljordian demi-gods in favor of venerating the Three Sisters as goddesses, affecting the worship of Anivia and her siblings over time.\nIt's believed that even death cannot touch Anivia herself, as many stories tell of how she had been struck down a handful of times throughout history, always followed by a magnificent rebirthfor as long as the Freljord exists, her soul remains immortal. Each rebirth may take hundreds or thousands of years before she rises again, but they always coincide with the dawn of a new era for the Freljord, causing her appearance to be both a wondrous blessing as well as an omen of great or terrible changes on the horizon.\nLegend has it that Anivia once sacrificed herself against a march of towering Balestriders , colossal and ancient creatures now corrupted by the influence of Lissandra. Though she was incapable of truly slaying these creatures, she instead plunged into the ice beneath their feet and shattered her own body, entombing them beneath the ice and snow.\nAnivia is ancient enough to have witnessed countless mortal civilizations and is highly revered to by many tribal communities of the Freljord. Many stories and legends have been told in Anivia's honor, cementing her as a staple for most of Freljordian mythology and culture.\nOne of the oldest stories of Anivia tells of how her brother Ornn felled one of her favorite perching trees to build his house the Horn Hall. Annoyed by this, Anivia sought to prank her brother by tickling his nose with her feathers as he slept, causing him to sneeze out a gout of flame and setting his bedsheets on fire. Anivia, panicked by the blaze of fire building in the wooden house, flapped her wings to fly away and accidentally stoked the fire even hotter within the dry Freljordian air, causing all of Horn Hall to light ablaze. Ornn woke up on top of a pile of ashes in a bad mood, feeling disturbed in his sleep but unaware of the prank Anivia did on him, something she hasn't told him to this day.\nThe nomadic Notai highly revere Anivia, traveling along the waves of frost believed to spill from Anivia's massive wings. Well known for their songs and storytelling, the Notai have many songs that detail Anivia's magnificent birth; bursting from a giant egg of ice and hurling tiny shards into the sky to eventually fall as snow.\nAnother tribe, called the Mourncrow, have sagas telling how the frigid winds and blizzards that scour the Freljord actually originate from the first beats of Anivia's wings when she first birthed into the world.\nThe Avarosan tribe have a legend about an Iceborn warmother named Ulla Shatter-Spear, who was favored by Anivia herself for saving a young Hawk from a Rimefang Wolf . Throughout Ulla's life, Anivia protected her from harm until she finally fell in battle after witnessing a hundred winters. After her death, Ulla's soul was welcomed by Anivia herself with wings spread wide.\nAnivia has reemerged from her egg once more, marking the start of a new era for the Freljord and bringing great change. She most recently appeared before Ashe , who continued her deceased mother Grena's search for the mythical Throne of Avarosa. Ashe, now the new warmother of the Avarosan tribe, is seen by Anivia as the one who can finally reunite the tribes of the Freljord and thus has somewhat gained the favor of the Cryophoenix.\nWith Anivia's return to the Freljord, more and more shamans and spirit walkers of the old demi-gods feel her presence and the new era she heralds to the Freljord, though they are unsure of what great threat she has come to face.",
    "personality": "Revered by both the Notai and the Yeti of old, Anivia is seen as a benevolent guardian deity. In Freljordian legends, she has noteably be an advocate for forgiveness and unity among all of the Freljord's people. The Notai and the Yeti have been called her \"children\" by her brothers before, hinting at her more nurturing nature. She also advocates diplomacy before war, as seen when she advises her kin to work together with the Three Sisters.\nWhile she is a peaceful being, she is not a pacifist. She has notably defended the Freljord from outside forces like Southerners who seek to claim the Vorrijaard as their own as well as Voidborn and the Watchers that created them, who threaten Runeterra itself. While she is unable to die, she is willing to sacrifice herself in order to save the Freljord from annihilation.",
    "appearance": "Anivia is massive eagle-like creature composed entirely of crystalline blue ice. She also has a single fuchsia crystal on her forehead. Her egg form is an icy globe which glows with white magic and appears swaddled in a nest of icy spikes."
  },
  {
    "name": "Annie (Character)",
    "url": "https://leagueoflegends.fandom.com/wiki/Annie",
    "infobox": {},
    "background": "Annie was born to Gregori Hastur and Amoline Kiosar , two mages that fled the capital city of Noxus due to their uncertainty of Boram Darkwill's rule. Unbeknownst to Gregori, Amoline was actually a runaway from the 1 Ravenbloom Conservatory , a school run by the Black Rose where she was experimentally fused with a Demon named Tybaulk .\nThe couple made a home in the Ironspike Mountains and Amolie became pregnant. In anticipation for her child's birth, Amoline crafted a stuffed teddy bear based off of the mysterious shadow bears rumored to roam the lands around them. As she applied finishing touches to the toy, Amoline suddenly went into labor and gave birth to Annie.\nAs a newborn, Annie was given the teddy bear that her mother made for her. When Annie was a toddler, she and her father got ill with a fever that was so hot that Amoline couldn't even touch her. Amoline tried using ice water from the river to ease her daughter's fever but became desperate, resorting to using the powers of the demon Tybaulk to save her. By infusing the demon into Annie's stuffed bear, Annie's illness was magically cured at the cost of Amoline's own life. Gregori woke up the next day, Annie in her crib, cured of her fever and playing with her stuffed bear she now named Tibbers . Amoline however was nowhere to be seen.\nGrowing up, Annie's latent magical abilities began to manifest, allowing her to manipulate the flames of the fireplace without her father noticing. Annie navely believed that her mother would return one day, and could often be found sitting by the fireplace in her mother's rocking chair and clutching Tibbers tightly while waiting for her mother's return.\nAs more people began settling around the Ironspike Mountains, Gregori fell in love with one of these settlers named Leanna , who had a daughter of her own named Daisy . Gregori soon married Leanna and the two families joined together, making Leanna Annie's new step-mother. Leanna began to grow disturbed by Annie, often finding her morbid crayon drawings depicting Amoline and Tibbers. Daisy on the other hand grew close with Annie as sisters, but grew terrified of Tibbers and Annie's fire magic, which often sparked from her short temper.\nWhile playing outside, the two chased a Faerie around the forest and followed it to a river. Though Annie protested against chasing it across the river, Daisy began skipping on stones to reach the Faerie, losing her balance and slipping. As the waters started to take Daisy, Annie reached out with her bear and allowed her step-sister to grab on. As Daisy held on, Annie's magical abilities began to flare up as Tibbers glowed with a light fire. Frightened by Annie's magic, Daisy panicked and let go of Tibbers, drowning in the river while Annie watched helplessly.\nMourning the death of her step-sister, Annie overheard Leanna as she blamed Annie and called her a monster to Gregori's face. Overwhelmed with grief and emotion, Annie ran to her room and sobbed as she slowly lost control of her magic, setting her room on fire. Soon the entire house caught aflame as Gregori ran into his daughter's room and carried her out of the burning house. As the house began to collapse, some rubble from the ceiling began to fall, forcing Gregori to throw Annie to safety as he sacrificed himself to save her, getting crushed to death by the falling rubble.\nAs the whole house was in ashes, Leanna violently expressed her spite towards Annie, vocally blaming her for everything. As Leanna snatched Tibbers away from Annie, she tried to tear the bear apart out of anger, triggering Annie's full rage as she manifested the demonic Tybaulk by animating her teddy bear for the first time, viciously tearing Leanna into pieces. Now, completely alone, traumatized and orphaned, Annie wandered off into the countryside with only her bear Tibbers to keep her company.\nAnnie wandered the northern parts of Noxus while avoiding the capital city, believing that most city Noxians would be similar to her hated step-mother. Occasionally on her travels, Annie would use her adorable exterior to convince a family to take her in and care for her, which would usually end in a fire and death when anyone tries to separate Annie from her stuffed bear. At some point, Annie was adopted by a family who gave her a new set of clothes; her signature pink and purple outfit along with her horned tiara. It's unknown what happened to them, but they are presumed to have been killed by Annie's uncontrollable fire magic.\nAt some point, Annie ended up at a tavern run by a bartender named Marcin. Ominously, Annie skipped through the tavern doors and asked Marcin for a cup of milk, which Marcin was confused by but complied anyway. As he got the girl a cup of milk, Annie paid with a full bag of coins that was more than necessary for payment. A nearby bounty hunter overheard and caught glimpse of the large sum of gold, demanding to know where she found so much money. As the bounty hunter continued to provoke the young girl, Annie unleashed Tibbers, who immediately shredded the man apart and set the tavern on fire. Annie happily thanked the bartender before walking out as the entire structure crumbled into ashes.\nAnnie being taken into the 1 Ravenbloom Conservatory by Fynn Retrick. Annie skipping away as the school burns down behind her. 1/2\nAfter hearing rumors about a girl with fire magic roaming the northern Ironspike Mountains, the Ravenbloom Conservatory sent a scout named Fynn Retrick to investigate. Fynn, who personally knew Amoline in the past, found Annie and immediately recognized her as Amoline's daughter. Having been sent to retrieve the demon Tybaulk and realizing what Amoline had done with Annie, Fynn brought Annie back to the school with him to be enrolled as their newest student.\nIn the conservatory, Annie befriended most of her classmates, all of whom were youths wielding magical abilities. This included an Oovi-Kat vastaya named Daani , a boy named Sydell and a prodigy student named Faye . Annie showed a powerful talent for fire magic to the school and became extremely important due to the fact that she was directly linked to Tybaulk, an important asset that the school wished to regain control of. Annie was a temperamental and mischievous student, as her misbehavior proved too difficult for the faculty staff to control and discipline. Annie's temper eventually got the best of her as she summoned the full force of Tibbers and set the entire school on fire, forcing everybody to evacuate as the academy burned to ashes.",
    "personality": "Annie is childish and reckless, putting on a display of innocence while showing an unsettling sense of humor at times. She is very protective of Tibbers, seeing him as her best friend, and will not hesitate to animate him to attack whomever tries to harm her or snatches him from her. She is shown to have an indomitable will which impressed Tybaulk (the demon within Tibbers) enough to ally with her.",
    "appearance": "She is a young girl described with a bright-red hair and brilliants green eyes. She wears a infant gothic, with a pink and purple palette. She wears a horned tiara, who gives her the impression of an imp, and has a leather bag on her back. She seems to always carry a innocent and malicious face."
  }
]